In [1]:
import pandas as pd

In [4]:
dataset = pd.read_csv('D:\\ratings.csv')

In [47]:
films_rating = 5.0
new_dataset = dataset[ dataset.rating >= films_rating ]
new_dataset.groupby('movieId').count().sort_values('rating', ascending=False).head()

         userId  rating  timestamp
movieId
318       39553   39553      39553
296       32169   32169      32169
356       25918   25918      25918
260       25804   25804      25804
2571      25482   25482      25482

In [48]:
power_dataset = pd.read_csv('D:\\power.csv')

In [49]:
power_dataset.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [81]:
filtered_countries = power_dataset[ power_dataset['country'].isin(['Lithuania', 'Estonia', 'Latvia'])]
filtered_categories = filtered_countries[ (filtered_countries['category']==4) | (filtered_countries['category']==12) | (filtered_countries['category']==21)]
min_quantity = 0
final_data = filtered_categories[filtered_categories.quantity > min_quantity]

In [82]:
final_data['quantity'].sum()

970728.0

In [89]:
df = pd.read_html('https://fortrader.org/quotes') [2]

In [90]:
df.head()

                      Название       Цена  Изменение  Изменение(%)  Обновлено
0      Серебро Цена на серебро    19.0950     0.3130        1.6660        NaN
1    Палладий Цена на Палладий  2010.1500    20.3500        1.0200        NaN
2  Золото Цена золота на бирже  1812.0000     8.1000        0.4000        NaN
3      Платина Цены на платину   863.3000    18.5000        2.2000        NaN
4      Медь Цена меди на бирже     2.4575    -0.4545      -15.6078        NaN